drafts/2022-year-end-book-review.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://mjgpy3.github.io/me/rss.xml"
      title="RSS feed for https://mjgpy3.github.io/me">
<title>2022 Year End Book Review</title>
<meta name="author" content="Michael 'Gilli' Gilliland">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://mjgpy3.github.io/me">Gilli's Land</a>
</div></div>
<div id="content">
<div class="post-date">31 Dec 1999</div><h1 class="post-title"><a href="https://mjgpy3.github.io/me/../drafts/2022-year-end-book-review.html">2022 Year End Book Review</a></h1>

<div id="outline-container-org578de3e" class="outline-2">
<h2 id="org578de3e"><i>The Complete Short Stories of Fyodor Dostoevsky</i> (★★★★★ 5/5)</h2>
<div class="outline-text-2" id="text-org578de3e">
<p>
It's difficult to rate a collection of short stories. Even more so, it's difficult to find a collection where each story is as enriching as the next. Well, it's easy for me to give this collection a five, even in toto. Moreover, I assert, no story was any less enjoyable than the next.
</p>

<p>
Of course, I'm a little biased &#x2013; Dostoevsky is my favorite author. Though this is the case, at times I've struggled to finish his longer works. The short stories were wonderful because they were each gripping and, well, short!
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>How I found it</b></td>
<td class="org-left">I sought it out</td>
</tr>

<tr>
<td class="org-left"><b>Recommend for</b></td>
<td class="org-left">Readers of classics, short stories, Russian literature, Dosteovsky</td>
</tr>

<tr>
<td class="org-left"><b>"Buy test"</b></td>
<td class="org-left">I would buy this for a friend who falls into the <b>recommended for</b> set</td>
</tr>

<tr>
<td class="org-left"><b>Approx. time I took to read</b></td>
<td class="org-left">A month</td>
</tr>

<tr>
<td class="org-left"><b>One sentence summary</b></td>
<td class="org-left">Mishaps in Russia and the psychology of an 19th Century Russian</td>
</tr>

<tr>
<td class="org-left"><b>Standalone</b></td>
<td class="org-left">Yes</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org46dc798" class="outline-2">
<h2 id="org46dc798"><i>I'm Thinking of Ending Things</i> (★★★⯪☆ 3.5/5)</h2>
<div class="outline-text-2" id="text-org46dc798">
<p>
I had never heard of this book before but I read it for a book club. It struck me as being a postmodern, psychological thriller type of novel. This isn't in my normal line of reading so I reserve the right to be wholly off with that categorization.
</p>

<p>
I did enjoy it and found myself in suspense at times. It evokes a <i>spooky</i> feeling and contains a few twists and turns. I will mention, however, (at the risk of a spoiler &#x2013; skip this paragraph if you don't wanna hear it) I did find the ending to be quite predictable.
</p>

<p>
As book club books go, it was a pretty good one and spurred some interesting discussions. Around that topic I would so a few things, if you're looking to discuss or watch the movie:
</p>
<ul class="org-ul">
<li>the book club questions in the back of the novel are no where near as interesting as they could be.</li>
<li>don't expect the movie to be <i>anything</i> like the book. Aside from bearing the same title and having a few events in common, they are practically unrelated.</li>
</ul>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>How I found it</b></td>
<td class="org-left">Picked by other member of book club</td>
</tr>

<tr>
<td class="org-left"><b>Recommend for</b></td>
<td class="org-left">Readers of psychological thrillers, folks who like "weird" books</td>
</tr>

<tr>
<td class="org-left"><b>"Buy test"</b></td>
<td class="org-left">I probably wouldn't buy it for anyone</td>
</tr>

<tr>
<td class="org-left"><b>Approx. time I took to read</b></td>
<td class="org-left">A week</td>
</tr>

<tr>
<td class="org-left"><b>One sentence summary</b></td>
<td class="org-left">Young lovers float along a river of oddity</td>
</tr>

<tr>
<td class="org-left"><b>Standalone</b></td>
<td class="org-left">Yes</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgff55791" class="outline-2">
<h2 id="orgff55791"><i>Our Thoughts Determine Our Lives</i> (★★★★⯪ 4.5/5)</h2>
<div class="outline-text-2" id="text-orgff55791">
<p>
This was a very nice book along the vein of other Orthodox spirituality books I've read in recent years. Elder Thaddeus lived a most interesting life, filled with many spiritual lessons. This book is an expounding thereabouts.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>How I found it</b></td>
<td class="org-left">Saw it in our church's bookstore</td>
</tr>

<tr>
<td class="org-left"><b>Recommend for</b></td>
<td class="org-left">Orthodox Christians or those interested in spiritual life</td>
</tr>

<tr>
<td class="org-left"><b>"Buy test"</b></td>
<td class="org-left">I would buy this for friends who fall into the  <b>recommended for</b> section</td>
</tr>

<tr>
<td class="org-left"><b>Approx. time I took to read</b></td>
<td class="org-left">Three weeks</td>
</tr>

<tr>
<td class="org-left"><b>One sentence summary</b></td>
<td class="org-left">Our thoughts determine our lives</td>
</tr>

<tr>
<td class="org-left"><b>Standalone</b></td>
<td class="org-left">Yes</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd878916" class="outline-2">
<h2 id="orgd878916"><i>The Rust Programming Language</i></h2>
</div>

<div id="outline-container-orga97666d" class="outline-2">
<h2 id="orga97666d"><i>The Republic of Thieves</i></h2>
</div>

<div id="outline-container-org9593615" class="outline-2">
<h2 id="org9593615"><i>Endurance</i></h2>
</div>

<div id="outline-container-org4f7cc05" class="outline-2">
<h2 id="org4f7cc05"><i>Pushkin Poems</i></h2>
</div>

<div id="outline-container-org53dbaaf" class="outline-2">
<h2 id="org53dbaaf"><i>How Design Makes the World</i></h2>
</div>

<div id="outline-container-org6d14374" class="outline-2">
<h2 id="org6d14374"><i>On the Cosmic Mystery of Jesus Christ</i></h2>
</div>

<div id="outline-container-org96d4325" class="outline-2">
<h2 id="org96d4325"><i>Moby Dick</i></h2>
</div>

<div id="outline-container-orgbd77d69" class="outline-2">
<h2 id="orgbd77d69"><i>On the Divine Images</i></h2>
</div>

<div id="outline-container-org7ef83dd" class="outline-2">
<h2 id="org7ef83dd"><i>Early Christian Doctrines</i></h2>
</div>

<div id="outline-container-org75b95a9" class="outline-2">
<h2 id="org75b95a9"><i>The Name of the Wind</i></h2>
</div>

<div id="outline-container-org09aefbd" class="outline-2">
<h2 id="org09aefbd"><i>Notes from the Underground</i></h2>
</div>

<div id="outline-container-org080d110" class="outline-2">
<h2 id="org080d110"><i>War and Peace</i></h2>
</div>

<div id="outline-container-org65fb9fa" class="outline-2">
<h2 id="org65fb9fa"><i>The Name of the Wind</i> (★★⯪☆☆ 2.5/5)</h2>
<div class="outline-text-2" id="text-org65fb9fa">
<p>
Things I didn't like
</p>
<ul class="org-ul">
<li>Felt like a collection of side-quests</li>
<li>No major resolution for such a long (intro) book</li>
<li>Characters felt 1-dimensional (couldn't distinguish his friends, women all seemed like the same character)</li>
<li>Lots of repetition: gotta make tuition trope, main character always "realizes female character X is beautiful"</li>
<li>Auri (sewer girl) gave off an odd anime, crazy and cutesy vibe and I found myself cringing while reading this character</li>
<li>It felt like a Harry Potter wannabe at times</li>
<li>Plot was mostly bust with formulaic booms (character takes massive risk then gets a major reward or setback)</li>
<li>Some dialog and writing pulled us out of the "fantasy world" into clear early 2010s zeitgeist (e.g. debating modern idioms, character's sensibilities, citing formal logical fallacies)</li>
<li>Main character was something of an übermensch</li>
<li>Felt like author was projecting his ideals onto the main character</li>
<li>Spoilers on the back of the book, kind of, I guess</li>
</ul>

<p>
I think I would have enjoyed this more if I had
</p>
<ul class="org-ul">
<li>Entered it expecting young adult fantasy</li>
<li>Known it wouldn't resolve anything (and that the second book was so long and third forthcoming)</li>
<li>Not read <i>The Lies of Locke Lamora</i> so recently which had similarities but set too high a bar</li>
</ul>

<p>
The book was fan-service to reading. The main character's dream place was the Archives, he was seeking stories and look at the setting. A scribe was transcribing Kovthe telling his story, which at times even included embedded story tellers.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>How I found it</b></td>
<td class="org-left">Picked by other member of book club</td>
</tr>

<tr>
<td class="org-left"><b>Recommend for</b></td>
<td class="org-left">Fans of young adult fantasy</td>
</tr>

<tr>
<td class="org-left"><b>"Buy test"</b></td>
<td class="org-left">I would only buy this for a friend who specifically asked for it</td>
</tr>

<tr>
<td class="org-left"><b>Approx. time I took to read</b></td>
<td class="org-left">A week and a half</td>
</tr>

<tr>
<td class="org-left"><b>One sentence summary</b></td>
<td class="org-left">The childhood backstory of an incredibly gifted mage and musician</td>
</tr>

<tr>
<td class="org-left"><b>Standalone</b></td>
<td class="org-left">No</td>
</tr>
</tbody>
</table>
</div>
</div>
<div class="taglist"><a href="https://mjgpy3.github.io/me/tags.html">Tags</a>: <a href="https://mjgpy3.github.io/me/tag-reading.html">reading</a> <a href="https://mjgpy3.github.io/me/tag-review.html">review</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
